---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.EnergyAnalysisFailures.RoomNotPlacedWarn
source: html/d6161895-da58-fa9d-b851-88c0fbf6366b.htm
---
# Autodesk.Revit.DB.BuiltInFailures.EnergyAnalysisFailures.RoomNotPlacedWarn Property

[Family] is not placed. Physical properties such as area will display as "Not Placed" in schedules. You can place the [Family] using the option bar in the [Family] tool, or you can delete the [Family] in a schedule. [Room] will be ignored in the energy analysis model.

## Syntax (C#)
```csharp
public static FailureDefinitionId RoomNotPlacedWarn { get; }
```